In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import statistics
%matplotlib inline
import numpy as np

In [2]:
city_df = pd.read_csv("Resources/city_data.csv")

In [6]:
#can see that we have 3 columns: city, driver_count and type
#data type for city: string, for driver_count: numbers, for type: string
#120 rows with 3 cols
city_df.head()

           city  driver_count   type
0   Richardfort            38  Urban
1  Williamsstad            59  Urban
2   Port Angela            67  Urban
3    Rodneyfort            34  Urban
4   West Robert            39  Urban

In [9]:
ride_df = pd.read_csv("Resources/ride_data.csv")

In [12]:
#4 columns: city, data, fare and ride_id
#2375 rows, 4 cols
ride_df

                    city                 date   fare        ride_id
0     Lake Jonathanshire  2019-01-14 10:14:22  13.83  5739410935873
1     South Michelleport  2019-03-04 18:24:09  30.24  2343912425577
2     Port Samanthamouth  2019-02-24 04:29:00  33.44  2005065760003
3             Rodneyfort  2019-02-10 23:22:03  23.44  5149245426178
4             South Jack  2019-03-06 04:28:35  34.58  3908451377344
...                  ...                  ...    ...            ...
2370         Michaelberg  2019-04-29 17:04:39  13.38  8550365057598
2371     Lake Latoyabury  2019-01-30 00:05:47  20.76  9018727594352
2372         North Jaime  2019-02-10 21:03:50  11.11  2781339863778
2373        West Heather  2019-05-07 19:22:15  44.94  4256853490277
2374          Newtonview  2019-04-25 10:20:13  55.84  9990581345298

[2375 rows x 4 columns]

In [14]:
#see that we have no missing data for any column
city_df.isnull().sum()

city            0
driver_count    0
type            0
dtype: int64

In [15]:
#city and type as object, driver count as integer
city_df.dtypes

city            object
driver_count     int64
type            object
dtype: object

In [16]:
#66 urban, 36 suburban, 18 rural 
city_df.value_counts("type")

type
Urban       66
Suburban    36
Rural       18
dtype: int64

In [18]:
#also see no missing data
ride_df.isnull().sum()

city       0
date       0
fare       0
ride_id    0
dtype: int64

In [19]:
#city and date object, fare as float, ride_id as integer
ride_df.dtypes

city        object
date        object
fare       float64
ride_id      int64
dtype: object

In [21]:
#merging the 2 dataframes, do it with a column with the same data and the same col name in both dataframes 
#in this example, both have city so merge on it

pyber_df = pd.merge(city_df , ride_df , how = "left" , on = ["city" , "city"])

In [22]:
pyber_df

,city,driver_count,type,date,fare,ride_id
0,Richardfort,38,Urban,2019-02-24 08:40:38,13.93,5628545007794
1,Richardfort,38,Urban,2019-02-13 12:46:07,14.00,910050116494
2,Richardfort,38,Urban,2019-02-16 13:52:19,17.92,820639054416
3,Richardfort,38,Urban,2019-02-01 20:18:28,10.26,9554935945413
4,Richardfort,38,Urban,2019-04-17 02:26:37,23.00,720020655850
...,...,...,...,...,...,...
2370,Jessicaport,1,Rural,2019-01-31 17:57:25,58.29,623154556195
2371,South Saramouth,7,Rural,2019-02-20 16:32:36,44.29,3622365199969
2372,South Saramouth,7,Rural,2019-01-28 15:55:33,31.25,7118046558393
2373,South Saramouth,7,Rural,2019-03-27 21:07:16,11.87,170351888128
2374,South Saramouth,7,Rural,2019-04-12 18:11:50,57.23,5081198789583